app/views/user_groups/certify.html.erb

<%= form_tag do %>
  <% ShiftType.all.each do |shift_type| %>
    <div id="field">
      <%= check_box_tag "user_group[shift_type_ids][]", shift_type.id, @user_group.certifications.exists?(shift_type_id: shift_type.id) %><%= shift_type.title %>
---
SELECT "shift_types".* FROM "shift_types"
SELECT 1 FROM "certifications" WHERE "certifications"."user_group_id" = 2 AND "certifications"."shift_type_id" = 1 LIMIT 1