app/views/users/groups.html.erb

SELECT "user_groups".* FROM "user_groups"
---
<%= form_tag do %>
  <% UserGroup.all.each do |user_group| %>