app/views/users/index.html.erb

<div class="box left_div">
  <h2><%= t "users.find" %></h2>
---
SELECT "users".* FROM "users"