app/views/users/show.html.erb

SELECT "user_groups".* FROM "user_groups" INNER JOIN "user_groups_users" ON "user_groups"."id" = "user_groups_users"."user_group_id" WHERE "user_groups_users"."user_id" = 1
---
<div class="box left_div">
  <h3><%= t "users.groups" %></h3>