app/views/shifts/_form.html.erb

    <%= f.label :shift_type_id %>
    <%= select("shift", "shift_type_id", ShiftType.all.collect {|p| [ p.title, p.id ] }, {:include_blank => false}) %>
---
SELECT "shift_types".* FROM "shift_types"

    <%= f.label :user_id %>
    <%= select("shift", "user_id", User.all.collect {|p| [ p.username, p.id ] }, {:include_blank => true}) %>
---
SELECT "users".* FROM "users"