app/views/shifts/index.html.erb

    <td><%= shift.user ? shift.user.username : "No user" %></td>
    <td><%= shift.shift_type.certifications.where(user: shift.user) ? "No certification" : "Has certification" %></td>
---
SELECT "certifications".* FROM "certifications" WHERE "certifications"."shift_id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1