app/views/shifts/index.html.erb

SELECT "shifts".* FROM "shifts"
---

$(function(){
  var s = new Date();
  s.setHours(0);

  s = new Date().moveToDayOfWeek(1, -1);
  s.setHours(0)

  var e = new Date(s).add(7).days();

  cv = new CalendarView($("#calendar"),s,e);
  new WeekPicker($("#picker"), s, e, cv);
  //makeDayGrid();
  makeHourGrid();
  makeHalfHourGrid();

  cv.fetch();
  cv.refresh();

  makeEditable();
  //$( "#calendar").selectable({'filter':'.shift'});
