app/views/shifts/show.html.erb

  <b>Certification: Returns wrong value</b>
  <%= @shift.shift_type.certifications.where(user: @shift.user) ? "Has certification" : "No certification" %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1