app/controllers/shift_types_controller.rb

  def create
    @shift_type = ShiftType.new(params[:shift_type])

    respond_to do |format|
      if @shift_type.save
---
INSERT INTO "shift_types" ("created_at", "description", "location", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 22 Apr 2012 12:19:20 UTC +00:00], ["description", nil], ["location", nil], ["title", nil], ["updated_at", Sun, 22 Apr 2012 12:19:20 UTC +00:00]]

  def update
    @shift_type = ShiftType.find(params[:id])

    respond_to do |format|
      if @shift_type.update_attributes(params[:shift_type])
---
SELECT "shift_types".* FROM "shift_types" WHERE "shift_types"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "shift_types" SET "description" = 'Senvakt i baren, fra kl 22 til kl 02', "updated_at" = '2012-04-22 12:43:36.901387' WHERE "shift_types"."id" = 3

  def edit
    @shift_type = ShiftType.find(params[:id])
---
SELECT "shift_types".* FROM "shift_types" WHERE "shift_types"."id" = ? LIMIT 1  [["id", "2"]]

  def destroy
    @shift_type = ShiftType.find(params[:id])
    @shift_type.destroy
---
SELECT "shift_types".* FROM "shift_types" WHERE "shift_types"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "shift_types" WHERE "shift_types"."id" = ?  [["id", 2]]

  def index
    @shift_types = ShiftType.all
---
SELECT "shift_types".* FROM "shift_types"

  def show
    @shift_type = ShiftType.find(params[:id])
---
SELECT "shift_types".* FROM "shift_types" WHERE "shift_types"."id" = ? LIMIT 1  [["id", "2"]]