app/controllers/shifts_controller.rb

  def index

    if params[:user_id]
      @user = User.find(params[:user_id])
    end

    if params[:start] and params[:stop]
      if params[:updated]
        params[:updated] = 1.seconds.since DateTime.parse params[:updated]
        @shifts = Shift.where("updated_at > :updated AND ((start >= :start AND start <= :end) or (end >= :start AND end <= :end))", {:start=>params[:start], :end=>params[:stop], :updated=>params[:updated]})

      else

        @shifts = Shift.where("(start >= :start AND start <= :end) or (end >= :start AND end <= :end)", {:start=>params[:start], :end=>params[:stop]})
      end

      if params[:filter]
        if params[:filter][:shift_type]
          @shifts = @shifts.where("shift_type_id IN (?)", params[:filter][:shift_type])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "shift_types".* FROM "shift_types" WHERE "shift_types"."id" = 1 LIMIT 1

  def create
    @shift = Shift.new(params[:shift])

    respond_to do |format|
      if @shift.save
---
INSERT INTO "shifts" ("comment", "created_at", "end", "leasing", "shift_type_id", "start", "training", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @shift = Shift.find(params[:id])
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @shift = Shift.find(params[:id])

    respond_to do |format|
      if @shift.update_attributes(params[:shift])
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "shifts" SET "user_id" = NULL, "start" = '2012-04-21 23:20:00.000000', "end" = '2012-04-22 01:20:00.000000', "updated_at" = '2012-04-22 14:55:02.244045' WHERE "shifts"."id" = 1

  def show
    @shift = Shift.find(params[:id])
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @shift = Shift.find(params[:id])
    @shift.destroy
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "shifts" WHERE "shifts"."id" = ?  [["id", 2]]