app/controllers/user_groups_controller.rb

SELECT "user_groups".* FROM "user_groups"
---
  def index
    @user_groups = UserGroup.all

INSERT INTO "user_groups" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 24 Apr 2012 13:15:34 UTC +00:00], ["name", "Kaféfunk"], ["updated_at", Tue, 24 Apr 2012 13:15:34 UTC +00:00]]
---
  def create
    @user_group = UserGroup.new(params[:user_group])

    respond_to do |format|
      if @user_group.save

SELECT "user_groups".* FROM "user_groups" WHERE "user_groups"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @user_group = UserGroup.find(params[:id])

SELECT "user_groups".* FROM "user_groups" WHERE "user_groups"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @user_group = UserGroup.find(params[:id])

SELECT "user_groups".* FROM "user_groups" WHERE "user_groups"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @user_group = UserGroup.find(params[:id])

SELECT "user_groups".* FROM "user_groups" WHERE "user_groups"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "user_groups" WHERE "user_groups"."id" = ?  [["id", 1]]
---
  def destroy
    @user_group = UserGroup.find(params[:id])
    @user_group.destroy

SELECT "user_groups".* FROM "user_groups" WHERE "user_groups"."id" = ? LIMIT 1  [["id", "2"]]
---
  def certify
    @user_group = UserGroup.find(params[:id])

SELECT "user_groups".* FROM "user_groups" WHERE "user_groups"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "certifications" WHERE "certifications"."id" = ?  [["id", 3]]
SELECT "certifications".* FROM "certifications" WHERE "certifications"."user_group_id" = 3
SELECT "shift_types".* FROM "shift_types" WHERE "shift_types"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "certifications" ("created_at", "manager", "shift_type_id", "updated_at", "user", "user_group_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 24 Apr 2012 22:06:55 UTC +00:00], ["manager", false], ["shift_type_id", 2], ["updated_at", Tue, 24 Apr 2012 22:06:55 UTC +00:00], ["user", false], ["user_group_id", 3]]
---
  def update_certifications
    @user_group = UserGroup.find(params[:id])
    @user_group.certifications.destroy_all

    errors = false
    manages = params[:user_group_manage][:shift_type_ids]
    params[:user_group][:shift_type_ids].each do |st_id|
      c = Certification.new(user_group: @user_group, shift_type: ShiftType.find(st_id), manager:manages.include?(st_id));
      if not c.save