app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "last_login", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", Mon, 23 Apr 2012 15:46:05 UTC +00:00], ["last_login", nil], ["updated_at", Mon, 23 Apr 2012 15:46:05 UTC +00:00], ["username", "testbruker"]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "users" SET "admin" = 't', "updated_at" = '2012-04-24 12:40:41.908751' WHERE "users"."id" = 3
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
    def groups
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "user_groups_users" ("user_id", "user_group_id") VALUES (1, 2)
SELECT "user_groups".* FROM "user_groups" WHERE "user_groups"."id" = ? LIMIT 1  [["id", "2"]]
---
  def update_groups
    @user = User.find(params[:id])
    @user.user_groups.destroy_all

    params[:user][:user_group_ids].each do |ug_id|
      @user.user_groups << UserGroup.find(ug_id)